wit/react-context/index.org
#+TITLE: React Context --- simple!

On commence simplement par créer l'application React toute
simple, et démarrer VS Code. On est paresseux alors:

#+begin_src bash
npx create-react-app toy-context && cd $_ && code .
#+end_src

Pour mémoire:

- ~&&~ permet de lier des commandes qui s'executent les unes
  après les autres. La chaîne est brisée si une des
  commandes échoue et les commandes suivantes ne s'executent
  donc pas.
- ~$_~ est le dernier argument de la commande précédente en
  bash (donc ça marche avec bash, sous Linux ou cmder).

* Nettoyage

On a pas besoin d'un App aussi gros, hop, un coup d'éponge:

#+begin_src js
import './App.css'


function App() {
  return (
    <div>
      youhou
    </div>
  )
}

export default App
#+end_src

* Mis en place

Ici on veut voir ~Context~, pas faire une application utile,
nous isolons autant que possible le problème pour n'avoir
que lui a examiner. On va complètement éliminer:

- les questions de styles
- les questions d'utilité
- les bons usages du code (hop, fenêtre)
- toute tentative de faire une application qui serve

L'utilité d'avoir un ~Context~ est de pouvoir consommer des
props n'importe où dans l'arbre des composants sans avoir à
passer des props partout.

On va écrire trois composants qui s'emboitent, =A=, =B=, et
=C=. Sous src, on aura donc l'arborescence

#+begin_example
├── App.css
├── App.js
...
├── components
│   ├── A
│   │   └── index.jsx
│   ├── B
│   │   └── index.jsx
│   └── C
│       └── index.jsx
...
#+end_example

Si vous avez vos préférences (par exemple avoir A.jsx
directement sans répertoire A, faites comme vous préférez).

Chaque composant va commencer tout simple:

#+CAPTION: Composant A
#+begin_src js
export default function A(){
    return null
}
#+end_src

#+CAPTION: Composant B
#+begin_src js
export default function B(){
    return null
}
#+end_src

#+CAPTION: Composant C
#+begin_src js
export default function C(){
    return null
}
#+end_src

Hmm, l'idée est quand même de pouvoir accéder à des props
plus haut dans l'arbre des composants sans les passer
explicitement.

On va modifier un peut notre code:

#+CAPTION: APP
#+begin_src js
import './App.css'

import A from './components/A'

function App() {
  return (
    <A />
  )
}

export default App
#+end_src


#+CAPTION: A
#+begin_src js
import B from '../B'

export default function A(){
    return <B />
}
#+end_src

#+CAPTION: B
#+begin_src js
import C from '../C'

export default function B(){
    return <C />
}
#+end_src

#+CAPTION: C
#+begin_src js
export default function C(){
    return <p>Leaf</p>
}
#+end_src

Notre arborescence de composant est maintenant:

#+begin_example
─── App
    │
    └── A
        │
        └── B
            │
            └── C
#+end_example

Le parfait terrain pour essayer de passer des props de App à
C.

