wit/react-context/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-23 jeu. 18:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>React Context &#x2014; simple!</title>
<meta name="author" content="gregory" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">React Context &#x2014; simple!</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgadbf354">1. Nettoyage</a></li>
<li><a href="#org25d05e4">2. Mis en place</a></li>
<li><a href="#org11262b4">3. Passage de state</a></li>
<li><a href="#org62a9915">4. Cap'tain Context to the Rescue</a></li>
</ul>
</div>
</div>
<p>
On commence simplement par créer l'application React toute
simple, et démarrer VS Code. On est paresseux alors:
</p>

<div class="org-src-container">
<pre class="src src-bash">npx create-react-app toy-context &amp;&amp; <span style="color: #483d8b;">cd</span> $<span style="color: #a0522d;">_</span> &amp;&amp; code .
</pre>
</div>

<p>
Pour mémoire:
</p>

<ul class="org-ul">
<li><code>&amp;&amp;</code> permet de lier des commandes qui s'executent les unes
après les autres. La chaîne est brisée si une des
commandes échoue et les commandes suivantes ne s'executent
donc pas.</li>
<li><code>$_</code> est le dernier argument de la commande précédente en
bash (donc ça marche avec bash, sous Linux ou cmder).</li>
</ul>

<div id="outline-container-orgadbf354" class="outline-2">
<h2 id="orgadbf354"><span class="section-number-2">1.</span> Nettoyage</h2>
<div class="outline-text-2" id="text-1">
<p>
On a pas besoin d'un App aussi gros, hop, un coup d'éponge:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #a020f0;">import</span> <span style="color: #8b2252;">'./App.css'</span>


<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">App</span>() {
  <span style="color: #a020f0;">return</span> (
    &lt;div&gt;
      youhou
    &lt;/div&gt;
  )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> App
</pre>
</div>
</div>
</div>

<div id="outline-container-org25d05e4" class="outline-2">
<h2 id="org25d05e4"><span class="section-number-2">2.</span> Mis en place</h2>
<div class="outline-text-2" id="text-2">
<p>
Ici on veut voir <code>Context</code>, pas faire une application utile,
nous isolons autant que possible le problème pour n'avoir
que lui a examiner. On va complètement éliminer:
</p>

<ul class="org-ul">
<li>les questions de styles</li>
<li>les questions d'utilité</li>
<li>les bons usages du code (hop, fenêtre)</li>
<li>toute tentative de faire une application qui serve</li>
</ul>

<p>
L'utilité d'avoir un <code>Context</code> est de pouvoir consommer des
props n'importe où dans l'arbre des composants sans avoir à
passer des props partout.
</p>

<p>
On va écrire trois composants qui s'emboitent, <code>A</code>, <code>B</code>, et
<code>C</code>. Sous src, on aura donc l'arborescence
</p>

<pre class="example" id="orgc3fdb23">
├── App.css
├── App.js
...
├── components
│   ├── A
│   │   └── index.jsx
│   ├── B
│   │   └── index.jsx
│   └── C
│       └── index.jsx
...
</pre>

<p>
Si vous avez vos préférences (par exemple avoir A.jsx
directement sans répertoire A, faites comme vous préférez).
</p>

<p>
Chaque composant va commencer tout simple:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Composant A</label><pre class="src src-js"><span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> A(){
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">null</span>
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Composant B</label><pre class="src src-js"><span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> B(){
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">null</span>
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Composant C</label><pre class="src src-js"><span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> C(){
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">null</span>
}
</pre>
</div>

<p>
Hmm, l'idée est quand même de pouvoir accéder à des props
plus haut dans l'arbre des composants sans les passer
explicitement.
</p>

<p>
On va modifier un peut notre code:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>APP</label><pre class="src src-js"><span style="color: #a020f0;">import</span> <span style="color: #8b2252;">'./App.css'</span>

<span style="color: #a020f0;">import</span> A from <span style="color: #8b2252;">'./components/A'</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">App</span>() {
  <span style="color: #a020f0;">return</span> (
    &lt;A /&gt;
  )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> App
</pre>
</div>


<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>A</label><pre class="src src-js"><span style="color: #a020f0;">import</span> B from <span style="color: #8b2252;">'../B'</span>

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> A(){
    <span style="color: #a020f0;">return</span> &lt;B /&gt;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>B</label><pre class="src src-js"><span style="color: #a020f0;">import</span> C from <span style="color: #8b2252;">'../C'</span>

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> B(){
    <span style="color: #a020f0;">return</span> &lt;C /&gt;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>C</label><pre class="src src-js"><span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> C(){
    <span style="color: #a020f0;">return</span> &lt;p&gt;Leaf&lt;/p&gt;
}
</pre>
</div>

<p>
Notre arborescence de composant est maintenant:
</p>

<pre class="example" id="orgc2873f5">
─── App
    │
    └── A
        │
        └── B
            │
            └── C
</pre>

<p>
Le parfait terrain pour essayer de passer des props de App à
C.
</p>
</div>
</div>
