wit/react-context/index.org
* Passage de state

Disons que nous avons un objet dans le state d'App qu'on
aimerait passer à C, par exemple

#+CAPTION: example de state
#+begin_src js
[
    {nom: 'banane',     compatibilitéChocolat: 'excellente' },
    {nom: 'gingembre',  compatibilitéChocolat: 'excellente' },
    {nom: 'choux vert', compatibilitéChocolat: 'bof' },
    {nom: 'Gribouille', compatibilitéChocolat:  null }
]
#+end_src

Il est possible que nous ayons obtenu cet objet via un
fetch, c'est sans importance, on se concentre sur ~Context~.

Du coup, on modifie =App=:

#+begin_src js
import './App.css'

import { useEffect, useState } from 'react'

import A from './components/A'

const chocoInit = [
  {nom: 'banane',     compatibilitéChocolat: 'excellente' },
  {nom: 'gingembre',  compatibilitéChocolat: 'excellente' },
  {nom: 'choux vert', compatibilitéChocolat: 'bof' },
  {nom: 'Gribouille', compatibilitéChocolat:  null }
]

function App() {
  const [ chocoTable, setChocoTable ] = useState([])
  // On aurait pu s'en passer mais c'est pour la forme:
  useEffect(() => setChocoTable(chocoInit), [])
  return (
    <A chocoTable={chocoTable} />
  )
}

export default App
#+end_src

Comme dit dans le code, on aurait pu se passer du
~useEffect~ mais on veut quand même avoir quelque chose de
cohérent. C'est aussi l'occasion de revoir le second
argument à ~userEffect~: il détermine les valeurs dont les
changements provoquent un autre appel à ~useEffect~. Nous ne
voulons faire notre ~setChocoTable~ qu'une seule fois, nous
lui passons donc un array vide: on ne rappelle jamais
~useEffect~.

Du coup, comment faire pour que C ai accès à notre table
d'ingrédients? Avec les props, il faut passer la table à
travers A et B pour enfin les transmettre à C:

#+CAPTION: A
#+begin_src js
import B from '../B'

export default function A(props){
    const { chocoTable } = props
    return <B chocoTable={chocoTable} />
}
#+end_src

#+CAPTION: B
#+begin_src js
import C from '../C'

export default function B(props){
    const { chocoTable } = props
    return <C chocoTable={chocoTable} />
}
#+end_src

#+CAPTION: C
#+begin_src js
export default function C(props){
    const { chocoTable } = props
    return <>
        {chocoTable.map( item => <p key={item.nom}>{item.nom}</p>)}
    </>
}
#+end_src

Beuh! Tous nos composants parlent de chocoTable maintenant,
dégeu! On en a besoin que dans App et dans C! On aimerait
bien nettoyer ça.

