wit/react-context/index.html

<div id="outline-container-org11262b4" class="outline-2">
<h2 id="org11262b4"><span class="section-number-2">3.</span> Passage de state</h2>
<div class="outline-text-2" id="text-3">
<p>
Disons que nous avons un objet dans le state d'App qu'on
aimerait passer à C, par exemple
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>example de state</label><pre class="src src-js">[
    {nom: <span style="color: #8b2252;">'banane'</span>,     compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
    {nom: <span style="color: #8b2252;">'gingembre'</span>,  compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
    {nom: <span style="color: #8b2252;">'choux vert'</span>, compatibilit&#233;Chocolat: <span style="color: #8b2252;">'bof'</span> },
    {nom: <span style="color: #8b2252;">'Gribouille'</span>, compatibilit&#233;Chocolat:  <span style="color: #008b8b;">null</span> }
]
</pre>
</div>

<p>
Il est possible que nous ayons obtenu cet objet via un
fetch, c'est sans importance, on se concentre sur <code>Context</code>.
</p>

<p>
Du coup, on modifie <code>App</code>:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #a020f0;">import</span> <span style="color: #8b2252;">'./App.css'</span>

<span style="color: #a020f0;">import</span> { useEffect, useState } from <span style="color: #8b2252;">'react'</span>

<span style="color: #a020f0;">import</span> A from <span style="color: #8b2252;">'./components/A'</span>

<span style="color: #a020f0;">const</span> <span style="color: #a0522d;">chocoInit</span> = [
  {nom: <span style="color: #8b2252;">'banane'</span>,     compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
  {nom: <span style="color: #8b2252;">'gingembre'</span>,  compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
  {nom: <span style="color: #8b2252;">'choux vert'</span>, compatibilit&#233;Chocolat: <span style="color: #8b2252;">'bof'</span> },
  {nom: <span style="color: #8b2252;">'Gribouille'</span>, compatibilit&#233;Chocolat:  <span style="color: #008b8b;">null</span> }
]

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">App</span>() {
  <span style="color: #a020f0;">const</span> [ <span style="color: #a0522d;">chocoTable</span>, <span style="color: #a0522d;">setChocoTable</span> ] = useState([])
  <span style="color: #b22222;">// </span><span style="color: #b22222;">On aurait pu s'en passer mais c'est pour la forme:</span>
  useEffect(() =&gt; setChocoTable(chocoInit), [])
  <span style="color: #a020f0;">return</span> (
    &lt;A chocoTable={chocoTable} /&gt;
  )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> App
</pre>
</div>

<p>
Comme dit dans le code, on aurait pu se passer du
<code>useEffect</code> mais on veut quand même avoir quelque chose de
cohérent. C'est aussi l'occasion de revoir le second
argument à <code>userEffect</code>: il détermine les valeurs dont les
changements provoquent un autre appel à <code>useEffect</code>. Nous ne
voulons faire notre <code>setChocoTable</code> qu'une seule fois, nous
lui passons donc un array vide: on ne rappelle jamais
<code>useEffect</code>.
</p>

<p>
Du coup, comment faire pour que C ai accès à notre table
d'ingrédients? Avec les props, il faut passer la table à
travers A et B pour enfin les transmettre à C:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>A</label><pre class="src src-js"><span style="color: #a020f0;">import</span> B from <span style="color: #8b2252;">'../B'</span>

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> A(<span style="color: #a0522d;">props</span>){
    <span style="color: #a020f0;">const</span> { chocoTable } = props
    <span style="color: #a020f0;">return</span> &lt;B chocoTable={chocoTable} /&gt;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>B</label><pre class="src src-js"><span style="color: #a020f0;">import</span> C from <span style="color: #8b2252;">'../C'</span>

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> B(<span style="color: #a0522d;">props</span>){
    <span style="color: #a020f0;">const</span> { chocoTable } = props
    <span style="color: #a020f0;">return</span> &lt;C chocoTable={chocoTable} /&gt;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>C</label><pre class="src src-js"><span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> C(<span style="color: #a0522d;">props</span>){
    <span style="color: #a020f0;">const</span> { chocoTable } = props
    <span style="color: #a020f0;">return</span> &lt;&gt;
        {chocoTable.map( item =&gt; &lt;p key={item.nom}&gt;{item.nom}&lt;/p&gt;)}
    &lt;/&gt;
}
</pre>
</div>

<p>
Beuh! Tous nos composants parlent de chocoTable maintenant,
dégeu! On en a besoin que dans App et dans C! On aimerait
bien nettoyer ça.
</p>
</div>
</div>
