wit/react-context/index.html

<div id="outline-container-org62a9915" class="outline-2">
<h2 id="org62a9915"><span class="section-number-2">4.</span> Cap'tain Context to the Rescue</h2>
<div class="outline-text-2" id="text-4">
<p>
On va commencer par créer un ChocolatContext
</p>

<pre class="example" id="org422d240">
├── App.js
├── ChocoContext
│   └── index.js
├── components
│   ├── A
│   │   └── index.jsx
│   ├── B
│   │   └── index.jsx
│   └── C
│       └── index.jsx
</pre>

<p>
Avec le contenu suivant:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #a020f0;">import</span> { createContext } from <span style="color: #8b2252;">'react'</span>

<span style="color: #a020f0;">const</span> <span style="color: #a0522d;">chocoInit</span> = [
    {nom: <span style="color: #8b2252;">'banane'</span>,     compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
    {nom: <span style="color: #8b2252;">'gingembre'</span>,  compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
    {nom: <span style="color: #8b2252;">'choux vert'</span>, compatibilit&#233;Chocolat: <span style="color: #8b2252;">'bof'</span> },
    {nom: <span style="color: #8b2252;">'Gribouille'</span>, compatibilit&#233;Chocolat:  <span style="color: #008b8b;">null</span> }
]

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> createContext(chocoInit)
</pre>
</div>

<p>
On va éliminer toutes les props et n'utiliser que le context
dans un premier temps, le plus simplement possible.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 12: </span>App</label><pre class="src src-js"><span style="color: #a020f0;">import</span> <span style="color: #8b2252;">'./App.css'</span>

<span style="color: #a020f0;">import</span> A from <span style="color: #8b2252;">'./components/A'</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">App</span>() {
  <span style="color: #a020f0;">return</span> (
      &lt;A /&gt;
  )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> App
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 13: </span>A</label><pre class="src src-js"><span style="color: #a020f0;">import</span> B from <span style="color: #8b2252;">'../B'</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">A</span>(){
    <span style="color: #a020f0;">return</span> &lt;B /&gt;
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> A
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 14: </span>B</label><pre class="src src-js"><span style="color: #a020f0;">import</span> C from <span style="color: #8b2252;">'../C'</span>

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> B(<span style="color: #a0522d;">props</span>){
    <span style="color: #a020f0;">return</span> &lt;C  /&gt;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 15: </span>C</label><pre class="src src-js"><span style="color: #a020f0;">import</span> ChocoContext from <span style="color: #8b2252;">"../../ChocoContext"</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">C</span>(<span style="color: #a0522d;">props</span>){
    console.log(props)
    <span style="color: #a020f0;">const</span> { chocoTable } = props
    <span style="color: #a020f0;">return</span> &lt;&gt;
        {chocoTable.map( item =&gt; &lt;p key={item.nom}&gt;{item.nom}&lt;/p&gt;)}
    &lt;/&gt;
}

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">WrappedC</span>(){
    <span style="color: #a020f0;">return</span> (
        &lt;ChocoContext.Consumer&gt;
            {props =&gt; &lt;C chocoTable={props}/&gt;}
        &lt;/ChocoContext.Consumer&gt;
    )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> WrappedC
</pre>
</div>

<p>
Ca fonctionne (si, si) mais c'est tout étrange ce
truc&#x2026;Voyons.
</p>

<p>
On a retrouvé notre <code>C</code> comme avant. Nous n'y touchons
pas. Mais nous ne l'exportons plus. Au lieu de <code>C</code>, nous
exportons une version enrobée d'un consommateur du context
<code>ChocoContext</code> qui s'appelle, surprise,
<code>ChocoContext.Consumer</code>.
</p>

<p>
A l'intérieur de ce <code>Consumer</code>, on a une fonction qui a un
paramètre, le contenu du contexte, et qui retourne notre
composant avec ses <code>props</code> qui ne viennent plus de son
parent mais du contexte lui-même.
</p>

<p>
Pour celles qui n'aiment pas <code>props</code> (je ne regarde
personne) mais qui veulent faire du code propre, on peut
écrire:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #a020f0;">import</span> ChocoContext from <span style="color: #8b2252;">"../../ChocoContext"</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">C</span>(<span style="color: #a0522d;">props</span>){
    console.log(props)
    <span style="color: #a020f0;">const</span> { chocoTable } = props
    <span style="color: #a020f0;">return</span> &lt;&gt;
        {chocoTable.map( item =&gt; &lt;p key={item.nom}&gt;{item.nom}&lt;/p&gt;)}
    &lt;/&gt;
}

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">WrappedC</span>(){
    <span style="color: #a020f0;">return</span> (
        &lt;ChocoContext.Consumer&gt;
            {chocoTable =&gt; &lt;C chocoTable={chocoTable}/&gt;}
        &lt;/ChocoContext.Consumer&gt;
    )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> WrappedC
</pre>
</div>

<p>
Ca marche avec un <code>Context</code> tout simple mais ça ne durera
pas&#x2026;On va voir ça rapidement.
</p>

<p>
Vous verrez dans la doc que dans <code>App</code> on peut mettre un
<code>ChocoContext.Provider</code> qui fait écho au <code>Consumer</code> et qui
envoie le contexte vers le bas. Ca n'est utile, dans les cas
simples, que si on veut changer la valeur par défaut du
contexte. On peut imaginer un composant qui reçoit les
defauts et un autre, dans un <code>&lt;ChocoContext.Provider
value={...}&gt;&lt;/ChocoContext.Provider&gt;</code>, qui reçoit les valeurs
spécifiques dénotées par paresse par &#x2026; 
</p>

<p>
Bon, c'est pas tout ça mais si on veut lire <b>et</b> modifier le
contexte?
</p>

<p>
Et bien, c'est moins élégant. Rappelez vous que React
encourage un style "fonctionnel". Par exemple on ne modifie
pas directement le <code>state</code>, on utilise <code>setState</code> avec un
<i>nouveau</i> <code>state</code>, une nouvelle valeur (qui peut être un
fragment du <code>state</code> si on ne modifie qu'une partie). Si on
modifie directement le <code>state</code>, React ne va pas correctement
rappeler <code>render</code> en cas de changement.
</p>

<p>
Du coup, pour nous, celà signifie qu'on va devoir utiliser
<code>useState</code>, quelque chose comme
<code>const [maValeur, setMaValeur]= useState(valeurInitiale)</code>.
</p>

<p>
Ensuite il va falloir passer <code>setMaValeur</code> dans l'attribut
<code>value</code> du provider. Ou une fonction qui appelle
<code>setMaValeur</code>, ce que nous allons faire pour rester simple.
</p>

<p>
Nous allons aussi devoir modifier notre contexte pour y
faire une place à notre fonction de modification.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span>ChocoContext</label><pre class="src src-js"><span style="color: #a020f0;">import</span> { createContext } from <span style="color: #8b2252;">'react'</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">La valeur initiale, s&#233;par&#233; pour clarifier</span>
<span style="color: #a020f0;">const</span> <span style="color: #a0522d;">chocoTableInit</span> = [
    {nom: <span style="color: #8b2252;">'banane'</span>,     compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
    {nom: <span style="color: #8b2252;">'gingembre'</span>,  compatibilit&#233;Chocolat: <span style="color: #8b2252;">'excellente'</span> },
    {nom: <span style="color: #8b2252;">'choux vert'</span>, compatibilit&#233;Chocolat: <span style="color: #8b2252;">'bof'</span> },
    {nom: <span style="color: #8b2252;">'Gribouille'</span>, compatibilit&#233;Chocolat:  <span style="color: #008b8b;">null</span> }
]

<span style="color: #b22222;">// </span><span style="color: #b22222;">chocoTable est vide, maintenant, il sera initialis&#233; avec</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">chocoTableInit dans le state d'App On a s&#233;par&#233; l'argument</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">de createContext pour n'y passer que le nom, pour</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">clarifi&#233; aussi</span>
<span style="color: #a020f0;">const</span> <span style="color: #a0522d;">chocoInit</span> = {
    chocoTable: [],
    chocoShake: () =&gt; {}
}

<span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ChocoContext</span> = createContext(chocoInit)

<span style="color: #b22222;">// </span><span style="color: #b22222;">on exporte donc &#224; la fois le context vide mais avec les</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">bonnes structures et les valeurs initiales</span>
<span style="color: #a020f0;">export</span> { ChocoContext, chocoTableInit }
App
<span style="color: #a020f0;">import</span> <span style="color: #8b2252;">'./App.css'</span>

<span style="color: #a020f0;">import</span> { useState } from <span style="color: #8b2252;">'react'</span>

<span style="color: #a020f0;">import</span> A from <span style="color: #8b2252;">'./components/A'</span>

<span style="color: #a020f0;">import</span> { ChocoContext, chocoTableInit } from <span style="color: #8b2252;">'./ChocoContext'</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">App</span>() {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">Alors... La valeur initiale du state chocoTable est</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">initialis&#233;e avec la valeur de chocoTableInit qui est</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">import&#233;e du module ChocoContexte</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">Gratuit: useState nous donne une proc&#233;dure pour</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">modifier ce state, nous l'appelons...setChocoTable.</span>
  <span style="color: #a020f0;">const</span> [ <span style="color: #a0522d;">chocoTable</span>, <span style="color: #a0522d;">setChocoTable</span> ] = useState(chocoTableInit)
  <span style="color: #b22222;">// </span><span style="color: #b22222;">Pour ne pas avoir &#224; charger le composant A, nous</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">inventons une fonction qui utilise setChocoTable sans</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">param&#232;tres. C'est cette fonction que nous passons dans</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">l'attribut value du Provider, avec chocoTable qui fait</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">partie du state d'App Vous noterez les doubles</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">moustaches: on passe un objet &#224; value et en JSX on</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">enferme les expressions javascript dans des {}. Double</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">dose.</span>
  <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">chocoShake</span> = () =&gt; setChocoTable([...chocoTable].reverse())
  <span style="color: #a020f0;">return</span> (
    &lt;ChocoContext.Provider value={{chocoTable, chocoShake}}&gt;
      &lt;A /&gt;
    &lt;/ChocoContext.Provider&gt;
  )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> App
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span>A</label><pre class="src src-js"><span style="color: #a020f0;">import</span> B from <span style="color: #8b2252;">'../B'</span>

<span style="color: #a020f0;">import</span> { ChocoContext } from <span style="color: #8b2252;">'../../ChocoContext'</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">A</span>(<span style="color: #a0522d;">props</span>){
    <span style="color: #b22222;">// </span><span style="color: #b22222;">on est bien content d'avoir utilis&#233; le nom props</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">comme tous les autres composants React plut&#244;t qu'un</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">truc invent&#233;...Ouf. Ici, on s'est simplifi&#233; la tache,</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">on a qu'&#224; passer le nom de la proc&#233;dure chocoShake &#224;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">onClick est c'est bon.</span>
    <span style="color: #a020f0;">const</span> { chocoShake } = props
    <span style="color: #a020f0;">return</span> &lt;&gt;
        &lt;button onClick={chocoShake}&gt;Reverse The Choco!&lt;/button&gt;
        &lt;B /&gt;
    &lt;/&gt;
}

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">WrappedA</span>(){
    <span style="color: #a020f0;">return</span> (
        &lt;ChocoContext.Consumer&gt;
            {props =&gt; &lt;A {...props} /&gt;}
        &lt;/ChocoContext.Consumer&gt;
    )
}


<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> WrappedA
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span>B</label><pre class="src src-js"><span style="color: #a020f0;">import</span> C from <span style="color: #8b2252;">'../C'</span>

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> <span style="color: #a020f0;">function</span> B(<span style="color: #a0522d;">props</span>){
    <span style="color: #a020f0;">return</span> &lt;C  /&gt;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 19: </span>C</label><pre class="src src-js"><span style="color: #a020f0;">import</span> { ChocoContext } from <span style="color: #8b2252;">"../../ChocoContext"</span>

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">C</span>(<span style="color: #a0522d;">props</span>){
    <span style="color: #a020f0;">return</span> &lt;&gt;
        {props.chocoTable.map( item =&gt; &lt;p key={item.nom}&gt;{item.nom}&lt;/p&gt;)}
    &lt;/&gt;
}

<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">WrappedC</span>(){
    <span style="color: #a020f0;">return</span> (
        &lt;ChocoContext.Consumer&gt;
            {props =&gt; &lt;C {...props} /&gt;}
        &lt;/ChocoContext.Consumer&gt;
    )
}

<span style="color: #a020f0;">export</span> <span style="color: #a020f0;">default</span> WrappedC
</pre>
</div>

<p>
Et voilà, A peut modifier le contexte et <code>C</code> peut le
consommer sans qu'on s'amuse à passer des props de
partout. Voilà aussi une excellente manière de ternir le
glorieux λ (la programmation fonctionnelle).
</p>

<p>
Promis, Redux est moins beurk. Bien fait, c'est même un peu
élégant.
</p>

<p>
Please: envoyez vos remarques, questions, commentaires,
critiques&#x2026;N'hésitez surtout pas, surtout si c'est négatif:
plus vous me communiquez vos retours et meilleurs seront les
supports.
</p>

<p>
Aussi, j'ai menti au début: <code>$_</code> c'est le dernier argument
de la commande précédente dans certains contextes seulement.
</p>

<p>
La sémantique de <code>$_</code> est, pour GNU Bash en tout cas:
</p>

<blockquote>
<p>
($_, an underscore.) At shell startup, set to the pathname
used to invoke the shell or shell script being executed as
passed in the environment or argument list. Subsequently,
expands to the last argument to the previous simple command
executed in the foreground, after expansion. Also set to the
full pathname used to invoke each command executed and
placed in the environment exported to that command. When
checking mail, this parameter holds the name of the mail
file. &#x2014; <a href="https://www.gnu.org/software/bash/manual/bash.html">GNU Bash</a>
</p>
</blockquote>

<p>
Une dernière chose avant de vous laissez, aller lire la doc
de React concernant le context, particulière la section
intitulée <a href="https://reactjs.org/docs/context.html#before-you-use-context">Before You Use Context</a>. La simple taille de cette
section devrait nous faire réfléchir&#x2026;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: gregory</p>
<p class="date">Created: 2023-03-23 jeu. 18:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>